Add a platform view test to android_hardware_smoke_test (#187913)
Expand test coverage to address more of
https://github.com/flutter/flutter/issues/182123

This adds a test with a platform view. In order to get both the flutter
pixels and the native pixels fully composited, we have to initiate the
screenshot from the test runner, not the app. This has a few
consequences for the architecture and data flow of the tests. Details in
the changes to README.md.

## Pre-launch Checklist

- [x] I read the [Contributor Guide] and followed the process outlined
there for submitting PRs.
- [x] I read the [AI contribution guidelines] and understand my
responsibilities, or I am not using AI tools.
- [x] I read the [Tree Hygiene] wiki page, which explains my
responsibilities.
- [x] I read and followed the [Flutter Style Guide], including [Features
we expect every widget to implement].
- [x] I signed the [CLA].
- [x] I listed at least one issue that this PR fixes in the description
above.
- [x] I updated/added relevant documentation (doc comments with `///`).
- [x] I added new tests to check the change I am making, or this PR is
[test-exempt].
- [x] I followed the [breaking change policy] and added [Data Driven
Fixes] where supported.
- [x] All existing and new tests are passing.

If you need help, consider asking for advice on the #hackers-new channel
on [Discord].
